Revit 2027 API
Panel.Transform Property
This property is used to find the transform of a curtain panel within project.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Transform Transform { get; }
Public ReadOnly Property Transform As Transform
	Get
public:
property Transform^ Transform {
	Transform^ get ();
}
member Transform : Transform with get
Property Value
Transform
Remarks
The Transform property returns a Autodesk::Revit::DB::Transform object that can be used to find the transfer matrix of a curtain panel within the project.
See Also
Reference
Panel Class
Autodesk.Revit.DB Namespace